#ifndef INCLUDE_SM3_H_
#define INCLUDE_SM3_H_


typedef struct SM3_CTX_
{
	unsigned int state[8], len, curlen;
	unsigned char buf[64];
}SM3_CTX;
/******************************************************************************
*功能：
*	计算SM3
*参数：
*	pInBuf		[in] 需要计算摘要的源数据
*	inLen		[in] 数据长度
*	pOutBuf  	[out]消息摘要
*返回值：
*
*******************************************************************************/
void SM3(const unsigned char *pInBuf, int inLen, unsigned char *pOutBuf);

/******************************************************************************
*功能：
*	SM3初始化
*参数：
*	ctx		[in] 缓存结构(void指针,与平台相关,为适应多平台,ctx由函数内部分配)
*
*返回值：
*	无
*******************************************************************************/
void SM3_Init(SM3_CTX **ctx);

/******************************************************************************
*功能：
*	计算SM3
*参数：
*	ctx		[in] 缓存结构(void指针,与平台相关)
*	pInBuf	[in] 输入数据
*	inLen	[in] 数据长度
*返回值：
*	无
*******************************************************************************/
void SM3_Update(SM3_CTX **ctx, const unsigned char *pInBuf, unsigned int inLen);

/******************************************************************************
*功能：
*	输出消息摘要
*参数：
*	ctx		[in] 缓存结构(void指针,与平台相关)
*	pOutBuf	[out]消息摘要值
*返回值：
*	无
*******************************************************************************/
void SM3_Final(SM3_CTX **ctx, unsigned char *pOutBuf);

#ifdef  __cplusplus
}
#endif

#endif
